/**
 * 1. 物理设备
 * 2. 物理像素：
 *  (1)像素是组成图像的最小单元
 *  (2)每台设备的像素的大小是不一致的，需要根据 屏幕的尺寸(斜边长)与屏幕分辨率来 计算得出每个物理像素的大小尺寸
 * 3. 逻辑像素：
 *  (1)如果世界上只存在物理像素，那么一般来说，高像素意味着大尺寸的屏幕，屏幕虽大，但是清晰度却不高
 *  (2)逻辑像素的概念 意味着 在一个物理像素中填充多少个 逻辑像素点来实现高清晰度的需求
 *  (3)以iphone6为例，规格实现的逻辑像素最高是 750 x 1334（dpr=750/375）,这个也叫做 分辨率。
 */

/**
 * 每一次提及 像素 要注意是 物理/逻辑，分辨率也是一样，要注意 语义
 * 1. 代码书写的px指的都是 逻辑像素
 *  (1)所以你写1px，在dpr不同的设备上，实际落到的物理像素是 0.5甚至更小，而不同的设备对这些 微小值，处理都不同
 * 2. 设计师干了什么？
 *  (1)设计师基于 375 x 667 进行设计，是什么意思？
 *  设计师按照 750px x 1334px 进行设计，这里的px是 逻辑像素，
 * 3. 我在代码中写750px的宽度，如果是逻辑像素，那么为什么在 浏览器iphone6的 375(drp 2)的环境中，会有滚动，难道不是应该刚好适配么？
 */

/**
 * 似乎有一个重大的理解问题
 * 现在更新知识如下：
 * 1. 逻辑像素(设备独立像素) iphone6的逻辑像素是 375 x 667
 * 2. 物理像素             iphone6的物理像素是 750 x 1334
 * 怎么记忆呢？
 * 逻辑像素 也就是只存在于逻辑内的像素，是为了服务开发用的
 * 物理像素 是一个屏幕能够展示的最小展示单元
 * dpr的理解是 物理像素/设备逻辑像素
 * 3. 我们代码中 所书写的都是 逻辑像素，也就是说我们写 1px的物理像素 
 * 实际在屏幕上渲染的是 2 X 2个物理像素，因为每个设备的屏幕尺寸不一致，
 * 那么不同设备的 物理像素的实际大小也不一致(同样是物理像素 750x1334 有的屏幕是4.3英寸，有的是5.7英寸)
 * 
 * 这就是说明我们写 375px的逻辑像素，会在屏幕上撑满
 */

/**
 * 那么像素对于我们的意义在哪里呢？
 * 物理像素越高，感觉影响的就是 比较粗呀，怎么和精细度结合起来呢？
 * 答案是：
 * 设计师给出的稿子是 基于物理像素的，也就是说稿子的 750px指的是 750个物理像素
 * 那么我们在一个 iphone6上 使用375px(逻辑像素)来承载这个图片，每一个逻辑像素能分到 2x2 个物理像素，实际上750px物理像素分到了750px的图片 那么清晰度达到了极限
 * 如果我们用 750px(逻辑像素)来承载，那么实际上物理像素就有 1500px，那么物理像素不对应，分到的少了，自然显得模糊
 */

/**
 * 为什么要进行自适应？
 * 虽然有了逻辑像素的概念，但是很多设备的逻辑像素依然不相等，比如 有 375的 有414的
 * 一味的按照 逻辑像素 来还原视觉稿，那么很有可能我们以为375撑满了屏幕，但是在414上 却有414-375的空白区
 */